anachrocomputer/PIC32GC/PIC32GameCube.X/GameCube.c
    // TODO: Add head LEDs and Add-On ports on daughter board
    
    ANSELBbits.ANSB6 = 1;   // Pot on pin 26, P1-37, RB6, AN6 analog
    TRISBbits.TRISB6 = 1;   // Pot on pin 26, P1-37, RB6, AN6 input
    
    TRISAbits.TRISA4 = 0;   // RA4 pin 60, P7 pin 6 as output (command pin)
    TRISAbits.TRISA5 = 1;   // RA5 pin 61, P7 pin 8 as input (reply pin)
    TRISDbits.TRISD0 = 0;   // RD0 pin 72, P7 pin 14 as output (SYNC signal)
}


int ReadController(const uint8_t cmd, const int nBits, uint8_t buf[])
{
    int i;
    uint32_t mask;
    const int expectedBits = nBits + 1;
    int actualBits = 0;
    int oneTime, zeroTime;
    int w, h, l;
    uint8_t pulseh[66];
    uint8_t pulsel[66];
    
    __builtin_disable_interrupts();      // Global interrupt disable
        
    mask = 0x80;

    for (i = 0; i < 8; i++)
    {
        if (cmd & mask)
        {
            LATACLR = _LATA_LATA4_MASK;  // 1us LOW

            dally(2);
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");

            LATASET = _LATA_LATA4_MASK;  // 3us HIGH

            dally(8);
        }
        else
        {
            LATACLR = _LATA_LATA4_MASK;  // 3us LOW

            dally(9);

            LATASET = _LATA_LATA4_MASK;  // 1us HIGH

            dally(1);
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
            __asm__("NOP");
        }

        mask >>= 1;
    }

    // Send stop bit, 1us LOW
    __asm__("NOP");
    __asm__("NOP");
    __asm__("NOP");
    __asm__("NOP");
    LATACLR = _LATA_LATA4_MASK;  // 1us LOW

    dally(2);

    LATASET = _LATA_LATA4_MASK;

    dally(1);
            
    for (w = 0; w < 256; w++)       // Wait for controller to pull line LOW
    {
        if (PORTAbits.RA5 == 0)
            break;
    }

    for (i = 0; i < expectedBits; i++)
    {
        for (l = 0; l < 64; l++)
            if (PORTAbits.RA5 != 0)
                break;

        for (h = 0; h < 64; h++)
            if (PORTAbits.RA5 == 0)
                break;

        pulseh[i] = h;
        pulsel[i] = l;
    }

    __builtin_enable_interrupts();       // Global interrupt enable

    memset(buf, 0, nBits / 8);

    oneTime = (pulsel[1] + pulseh[1]) / 3;
    zeroTime = oneTime * 2;
    
    if (w < 255)
    {
        for (i = 0; i < expectedBits; i++)
        {
            int bitVal;

            if (pulsel[i] > zeroTime)
            {
                bitVal = 0;
            }
            else if (pulsel[i] < oneTime)
            {
                bitVal = 1;
                buf[i / 8] |= 0x80 >> (i % 8);
            }
            else
            {
                bitVal = 2;
                actualBits = i;
            }

            //printf("%d: %2d %2d %2d %d\n", i, pulsel[i] + pulseh[i], pulsel[i], pulseh[i], bitVal);
        }

        //printf("cmd = %d, w = %d\n", cmd, w);
        
        return (actualBits);
    }
    else
    {
        //printf("cmd = %d, w = %d: No response from controller\n", cmd, w);
        
        return (0);
    }
}


void main(void)
{
    ControllerReply buf;
    
    /* Set up peripherals to match pin connections on PCB */
    PPS_begin();
    
    /* Configure tri-state registers */
    TRIS_begin();
    
    LATBbits.LATB15 = 0;  // HV_EN pin 44 LOW (6V regulator OFF)
    
    /* Switch off the MOSFETs */
    LATGbits.LATG15 = 0;  // U1EN pin 1 OFF
    LATEbits.LATE2 = 0;   // U2EN pin 98 OFF
    LATGbits.LATG12 = 0;  // U3EN pin 96 OFF
    LATDbits.LATD13 = 0;  // U4EN pin 80 OFF
    LATDbits.LATD11 = 0;  // U5EN pin 71 OFF
    
    UART1_begin(9600);
    UART2_begin(9600);
    UART3_begin(9600);
    UART4_begin(9600);
    UART5_begin(9600);

    ADC_begin();
    
    I2C1_begin(100);
    
    SPI3_begin(1000000);
    
    RPD8Rbits.RPD8R = 12; // OC1 on P7 pin 10 (LED PWM)
    
    /* Configure Timer 3 for 10-bit PWM */
    T3CONbits.TCKPS = 6;        // Timer 3 prescale: 64
    
    TMR3 = 0x00;                // Clear Timer 3 counter
    PR3 = 1023;                 // PWM range 0..1023 (10 bits)
    
    T3CONbits.ON = 1;           // Enable Timer 3
    
    OC1CONbits.OCTSEL = 1;      // Source: Timer 3
    OC1CONbits.OCM = 6;         // PWM mode
    
    OC1RS = 256;
    
    OC1CONbits.ON = 1;          // Enable OC1 PWM
            
    /* Configure Timer 1 */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = 39999;                // Interrupt every 40000 ticks (1ms)
    
    T1CONbits.ON = 1;           // Enable Timer 1
    
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
    
    IPC1bits.T1IP = 2;          // Timer 1 interrupt priority 2
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    IPC4bits.T4IP = 4;          // Timer 4 interrupt priority 4
    IPC4bits.T4IS = 1;          // Timer 4 interrupt sub-priority 1
    IFS0CLR = _IFS0_T4IF_MASK;  // Clear Timer 4 interrupt flag
    IEC0SET = _IEC0_T4IE_MASK;  // Enable Timer 4 interrupt
    
    __builtin_enable_interrupts();   // Global interrupt enable
    
    OLED_begin(MAXX, MAXY);
    
    greyFrame();
    
    updscreen();

    delayms(50);
    
    puts("GameCube");
    
    LATASET = _LATA_LATA4_MASK; // Set RA4 HIGH initially
    
    while (1)
    {
        memcpy(Frame, DdsLogo, sizeof (Frame));
        
        if (ReadController(0x01, 32, buf.asBytes) > 0)
        {
            char butStr[17];
            
            butStr[0]  = buf.asN64.butA      ? 'A' : '.';
            butStr[1]  = buf.asN64.butB      ? 'B' : '.';
            butStr[2]  = buf.asN64.butZ      ? 'Z' : '.';
            butStr[3]  = buf.asN64.butL      ? 'L' : '.';
            butStr[4]  = buf.asN64.butR      ? 'R' : '.';
            butStr[5]  = buf.asN64.butStart  ? 'S' : '.';
            butStr[6]  = buf.asN64.dpadLeft  ? 'L' : '.';
            butStr[7]  = buf.asN64.dpadRight ? 'R' : '.';
            butStr[8]  = buf.asN64.dpadUp    ? 'U' : '.';
            butStr[9]  = buf.asN64.dpadDown  ? 'D' : '.';
            butStr[10] = buf.asN64.cpadLeft  ? 'L' : '.';
            butStr[11] = buf.asN64.cpadRight ? 'R' : '.';
            butStr[12] = buf.asN64.cpadUp    ? 'U' : '.';
            butStr[13] = buf.asN64.cpadDown  ? 'D' : '.';
            butStr[14] = '\0';
            
            LED1 = buf.asN64.butA ? 0 : 1;
            LED2 = buf.asN64.butB ? 0 : 1;
            LED3 = buf.asN64.butZ ? 0 : 1;
            LED4 = buf.asN64.butL ? 0 : 1;
            LED5 = buf.asN64.butR ? 0 : 1;
            
            if (buf.asN64.butA)
                fillRect(0, 0, 8, 8, 1, 1);
            
            if (buf.asN64.butB)
                fillRect(8, 0, 16, 8, 1, 1);
            
            if (buf.asN64.butZ)
                fillRect(16, 0, 24, 8, 1, 1);
            
            if (buf.asN64.butL)
                fillRect(24, 0, 32, 8, 1, 1);
            
            if (buf.asN64.butR)
                fillRect(32, 0, 40, 8, 1, 1);
            
            if (buf.asN64.cpadLeft)
                fillRect(40, 0, 48, 8, 1, 1);
            
            if (buf.asN64.cpadRight)
                fillRect(48, 0, 56, 8, 1, 1);
            
            if (buf.asN64.cpadUp)
                fillRect(56, 0, 64, 8, 1, 1);
            
            if (buf.asN64.cpadDown)
                fillRect(64, 0, 72, 8, 1, 1);
            
            setVline(64 + buf.asN64.joyx, 8, 15);
            setVline(64 + buf.asN64.joyy, 16, 23);
            
            printf("%s %d %d\n", butStr, buf.asN64.joyx, buf.asN64.joyy);
        }
        else
        {
            LED1 = 1;
            LED2 = 1;
            LED3 = 1;
            LED4 = 1;
            LED5 = 1;
            
            printf("No reply\n");
        }
        
        updscreen();
        
        delayms(50);
    }
}

